wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_rcc.c
/**
  ******************************************************************************
  * @file    fm33l0xx_rcc.c
  * @author  FM33L0 Application Team
  * @version V0.1.1
  * @date    6-Dec-2019
  * @brief   This file provides firmware functions to manage the following 
  *          functionalities of....:
  *
*/

/* Includes ------------------------------------------------------------------*/
#include "fm33l0xx_rcc.h" 


/** @addtogroup fm33l0_StdPeriph_Driver
  * @{
  */

/** @defgroup RCC 
  * @brief RCC driver modules
  * @{
  */ 

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/


/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/** @defgroup RCC_Private_Functions
  * @{
  */

void RCC_LKP_CR_RST_EN_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		RCC->LKP_CR |= (RCC_LKP_CR_RST_EN_Msk);
	}
	else
	{
		RCC->LKP_CR &= ~(RCC_LKP_CR_RST_EN_Msk);
	}
}

FunState RCC_LKP_CR_RST_EN_Getable(void)
{
	if (RCC->LKP_CR & (RCC_LKP_CR_RST_EN_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

void RCC_SOFTRST_Write(uint32_t SetValue)
{
	RCC->SOFTRST = (SetValue);
}

void RCC_RSTFR_NRSTN_FLAG_Clr(void)
{
	RCC->RSTFR = RCC_RSTFR_NRSTN_FLAG_Msk;
}

FlagStatus RCC_RSTFR_NRSTN_FLAG_Chk(void)
{
	if (RCC->RSTFR & RCC_RSTFR_NRSTN_FLAG_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

void RCC_RSTFR_TESTN_FLAG_Clr(void)
{
	RCC->RSTFR = RCC_RSTFR_TESTN_FLAG_Msk;
}

FlagStatus RCC_RSTFR_TESTN_FLAG_Chk(void)
{
	if (RCC->RSTFR & RCC_RSTFR_TESTN_FLAG_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

void RCC_RSTFR_PORN_FLAG_Clr(void)
{
	RCC->RSTFR = RCC_RSTFR_PORN_FLAG_Msk;
}

FlagStatus RCC_RSTFR_PORN_FLAG_Chk(void)
{
	if (RCC->RSTFR & RCC_RSTFR_PORN_FLAG_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

void RCC_RSTFR_PDRN_FLAG_Clr(void)
{
	RCC->RSTFR = RCC_RSTFR_PDRN_FLAG_Msk;
}

FlagStatus RCC_RSTFR_PDRN_FLAG_Chk(void)
{
	if (RCC->RSTFR & RCC_RSTFR_PDRN_FLAG_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

void RCC_RSTFR_SOFTN_FLAG_Clr(void)
{
	RCC->RSTFR = RCC_RSTFR_SOFTN_FLAG_Msk;
}

FlagStatus RCC_RSTFR_SOFTN_FLAG_Chk(void)
{
	if (RCC->RSTFR & RCC_RSTFR_SOFTN_FLAG_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

void RCC_RSTFR_IWDTN_FLAG_Clr(void)
{
	RCC->RSTFR = RCC_RSTFR_IWDTN_FLAG_Msk;
}

FlagStatus RCC_RSTFR_IWDTN_FLAG_Chk(void)
{
	if (RCC->RSTFR & RCC_RSTFR_IWDTN_FLAG_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

void RCC_RSTFR_WWDTN_FLAG_Clr(void)
{
	RCC->RSTFR = RCC_RSTFR_WWDTN_FLAG_Msk;
}

FlagStatus RCC_RSTFR_WWDTN_FLAG_Chk(void)
{
	if (RCC->RSTFR & RCC_RSTFR_WWDTN_FLAG_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

void RCC_RSTFR_LKUPN_FLAG_Clr(void)
{
	RCC->RSTFR = RCC_RSTFR_LKUPN_FLAG_Msk;
}

FlagStatus RCC_RSTFR_LKUPN_FLAG_Chk(void)
{
	if (RCC->RSTFR & RCC_RSTFR_LKUPN_FLAG_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

void RCC_RSTFR_NVICN_FLAG_Clr(void)
{
	RCC->RSTFR = RCC_RSTFR_NVICN_FLAG_Msk;
}

FlagStatus RCC_RSTFR_NVICN_FLAG_Chk(void)
{
	if (RCC->RSTFR & RCC_RSTFR_NVICN_FLAG_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/* LSCLK自动切换使能 相关函数 */
void RCC_SYSCLK_CR_LSCATS_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		RCC->SYSCLK_CR |= (RCC_SYSCLK_CR_LSCATS_Msk);
	}
	else
	{
		RCC->SYSCLK_CR &= ~(RCC_SYSCLK_CR_LSCATS_Msk);
	}
}

FunState RCC_SYSCLK_CR_LSCATS_Getable(void)
{
	if (RCC->SYSCLK_CR & (RCC_SYSCLK_CR_LSCATS_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* Sleep/DeepSleep模式下EXTI采样设置 相关函数 */
void RCC_SYSCLK_CR_SLP_ENEXTI_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		RCC->SYSCLK_CR |= (RCC_SYSCLK_CR_SLP_ENEXTI_Msk);
	}
	else
	{
		RCC->SYSCLK_CR &= ~(RCC_SYSCLK_CR_SLP_ENEXTI_Msk);
	}
}

FunState RCC_SYSCLK_CR_SLP_ENEXTI_Getable(void)
{
	if (RCC->SYSCLK_CR & (RCC_SYSCLK_CR_SLP_ENEXTI_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* APB时钟分频选择 相关函数 */
void RCC_SYSCLK_CR_APBPRES_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = RCC->SYSCLK_CR;
	tmpreg &= ~(RCC_SYSCLK_CR_APBPRES_Msk);
	tmpreg |= (SetValue & RCC_SYSCLK_CR_APBPRES_Msk);
	RCC->SYSCLK_CR = tmpreg;
}

uint32_t RCC_SYSCLK_CR_APBPRES_Get(void)
{
	return (RCC->SYSCLK_CR & RCC_SYSCLK_CR_APBPRES_Msk);
}

/* AHB时钟分频选择 相关函数 */
void RCC_SYSCLK_CR_AHBPRES_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = RCC->SYSCLK_CR;
	tmpreg &= ~(RCC_SYSCLK_CR_AHBPRES_Msk);
	tmpreg |= (SetValue & RCC_SYSCLK_CR_AHBPRES_Msk);
	RCC->SYSCLK_CR = tmpreg;
}

uint32_t RCC_SYSCLK_CR_AHBPRES_Get(void)
{
	return (RCC->SYSCLK_CR & RCC_SYSCLK_CR_AHBPRES_Msk);
}

/* CPU内核systick工作时钟选择 相关函数 */
void RCC_SYSCLK_CR_STCLKSEL_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = RCC->SYSCLK_CR;
	tmpreg &= ~(RCC_SYSCLK_CR_STCLKSEL_Msk);
	tmpreg |= (SetValue & RCC_SYSCLK_CR_STCLKSEL_Msk);
	RCC->SYSCLK_CR = tmpreg;
}

uint32_t RCC_SYSCLK_CR_STCLKSEL_Get(void)
{
	return (RCC->SYSCLK_CR & RCC_SYSCLK_CR_STCLKSEL_Msk);
}

/* 系统时钟源选择 相关函数 */
void RCC_SYSCLK_CR_SYSCLKSEL_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = RCC->SYSCLK_CR;
	tmpreg &= ~(RCC_SYSCLK_CR_SYSCLKSEL_Msk);
	tmpreg |= (SetValue & RCC_SYSCLK_CR_SYSCLKSEL_Msk);
	RCC->SYSCLK_CR = tmpreg;
}

uint32_t RCC_SYSCLK_CR_SYSCLKSEL_Get(void)
{
	return (RCC->SYSCLK_CR & RCC_SYSCLK_CR_SYSCLKSEL_Msk);
}

/* RCHF频率选择寄存器 相关函数 */
void RCC_RCHF_CR_FSEL_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = RCC->RCHF_CR;
	tmpreg &= ~(RCC_RCHF_CR_FSEL_Msk);
	tmpreg |= (SetValue & RCC_RCHF_CR_FSEL_Msk);
	RCC->RCHF_CR = tmpreg;
}

uint32_t RCC_RCHF_CR_FSEL_Get(void)
{
	return (RCC->RCHF_CR & RCC_RCHF_CR_FSEL_Msk);
}

/* RCHF使能寄存器 相关函数 */
void RCC_RCHF_CR_EN_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		RCC->RCHF_CR |= (RCC_RCHF_CR_EN_Msk);
	}
	else
	{
		RCC->RCHF_CR &= ~(RCC_RCHF_CR_EN_Msk);
	}
}

FunState RCC_RCHF_CR_EN_Getable(void)
{
	if (RCC->RCHF_CR & (RCC_RCHF_CR_EN_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* RC4M频率调校寄存器 相关函数 */
void RCC_RC4M_TR_Write(uint32_t SetValue)
{
	RCC->RC4M_TR = (SetValue & RCC_RC4M_TR_TRIM_Msk);
}

uint32_t RCC_RC4M_TR_Read(void)
{
	return (RCC->RC4M_TR & RCC_RC4M_TR_TRIM_Msk);
}

