wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_rcc.c
/* PLL倍频比 相关函数 */
void RCC_PLL_CR_DB_Set(uint32_t SetValue)
{ 
  uint32_t tmpreg;
  SetValue <<= RCC_PLL_CR_DB_Pos;
	tmpreg = RCC->PLL_CR;
	tmpreg &= ~(RCC_PLL_CR_DB_Msk);
	tmpreg |= (SetValue & RCC_PLL_CR_DB_Msk);
	RCC->PLL_CR = tmpreg;
}

uint32_t RCC_PLL_CR_DB_Get(void)
{
	uint32_t tmpreg;
	
	tmpreg= (RCC->PLL_CR & RCC_PLL_CR_DB_Msk);
	return (tmpreg >> RCC_PLL_CR_DB_Pos);
}

/* PLL锁定标志 相关函数 */
FlagStatus RCC_PLL_CR_LOCKED_Chk(void)
{
	if (RCC->PLL_CR & RCC_PLL_CR_LOCKED_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/* PLL参考时钟预分频（目标是产生1MHz参考时钟给PLL） 相关函数 */
void RCC_PLL_CR_REFPRSC_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = RCC->PLL_CR;
	tmpreg &= ~(RCC_PLL_CR_REFPRSC_Msk);
	tmpreg |= (SetValue & RCC_PLL_CR_REFPRSC_Msk);
	RCC->PLL_CR = tmpreg;
}

uint32_t RCC_PLL_CR_REFPRSC_Get(void)
{
	return (RCC->PLL_CR & RCC_PLL_CR_REFPRSC_Msk);
}

/* PLL输出选择寄存器 相关函数 */
void RCC_PLL_CR_OSEL_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = RCC->PLL_CR;
	tmpreg &= ~(RCC_PLL_CR_OSEL_Msk);
	tmpreg |= (SetValue & RCC_PLL_CR_OSEL_Msk);
	RCC->PLL_CR = tmpreg;
}

uint32_t RCC_PLL_CR_OSEL_Get(void)
{
	return (RCC->PLL_CR & RCC_PLL_CR_OSEL_Msk);
}

/* PLL输入选择寄存器 相关函数 */
void RCC_PLL_CR_INSEL_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = RCC->PLL_CR;
	tmpreg &= ~(RCC_PLL_CR_INSEL_Msk);
	tmpreg |= (SetValue & RCC_PLL_CR_INSEL_Msk);
	RCC->PLL_CR = tmpreg;
}

uint32_t RCC_PLL_CR_INSEL_Get(void)
{
	return (RCC->PLL_CR & RCC_PLL_CR_INSEL_Msk);
}

/* PLL使能寄存器 相关函数 */
void RCC_PLL_CR_EN_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		RCC->PLL_CR |= (RCC_PLL_CR_EN_Msk);
	}
	else
	{
		RCC->PLL_CR &= ~(RCC_PLL_CR_EN_Msk);
	}
}

FunState RCC_PLL_CR_EN_Getable(void)
{
	if (RCC->PLL_CR & (RCC_PLL_CR_EN_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* RCLP使能标志信号 相关函数 */
FlagStatus RCC_RCLP_CR_OFF_EN_Chk(void)
{
	if (RCC->RCLP_CR & RCC_RCLP_CR_OFF_EN_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/* 休眠模式下RCLP控制寄存器 相关函数 */
void RCC_RCLP_CR_LPM_RCLP_OFF_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		RCC->RCLP_CR |= (RCC_RCLP_CR_LPM_RCLP_OFF_Msk);
	}
	else
	{
		RCC->RCLP_CR &= ~(RCC_RCLP_CR_LPM_RCLP_OFF_Msk);
	}
}

FunState RCC_RCLP_CR_LPM_RCLP_OFF_Getable(void)
{
	if (RCC->RCLP_CR & (RCC_RCLP_CR_LPM_RCLP_OFF_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* RCLP调校值寄存器 相关函数 */
void RCC_RCLP_TR_Write(uint32_t SetValue)
{
	RCC->RCLP_TR = (SetValue & RCC_RCLP_TR_TRIM_Msk);
}

uint32_t RCC_RCLP_TR_Read(void)
{
	return (RCC->RCLP_TR & RCC_RCLP_TR_TRIM_Msk);
}

/* XTLF备份时钟手动切换寄存器 相关函数 */
void RCC_XTLF_CR_Write(uint32_t SetValue)
{
	RCC->XTLF_CR = (SetValue & RCC_XTLF_CR_BKSW_Msk);
}

uint32_t RCC_XTLF_CR_Read(void)
{
	return (RCC->XTLF_CR & RCC_XTLF_CR_BKSW_Msk);
}

/* XTLF使能寄存器 相关函数 */
void RCC_XTLF_CR_EN_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = RCC->XTLF_CR;
	tmpreg &= ~(RCC_XTLF_CR_EN_Msk);
	tmpreg |= (SetValue & RCC_XTLF_CR_EN_Msk);
	RCC->XTLF_CR = tmpreg;
}

uint32_t RCC_XTLF_CR_EN_Get(void)
{
	return (RCC->XTLF_CR & RCC_XTLF_CR_EN_Msk);
}

/* XTLF工作电流选择 相关函数 */
void RCC_XTLF_CR_IPW_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = RCC->XTLF_CR;
	tmpreg &= ~(RCC_XTLF_CR_IPW_Msk);
	tmpreg |= (SetValue & RCC_XTLF_CR_IPW_Msk);
	RCC->XTLF_CR = tmpreg;
}

uint32_t RCC_XTLF_CR_IPW_Get(void)
{
	return (RCC->XTLF_CR & RCC_XTLF_CR_IPW_Msk);
}

/* AHB Master优先级配置寄存器 相关函数 */
void RCC_AHBM_CR_MPRIL_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = RCC->AHBM_CR;
	tmpreg &= ~(RCC_AHBM_CR_MPRIL_Msk);
	tmpreg |= (SetValue & RCC_AHBM_CR_MPRIL_Msk);
	RCC->AHBM_CR = tmpreg;
}

uint32_t RCC_AHBM_CR_MPRIL_Get(void)
{
	return (RCC->AHBM_CR & RCC_AHBM_CR_MPRIL_Msk);
}

/* 外设模块复位使能 相关函数 */
void RCC_PRST_EN_Write(uint32_t SetValue)
{
	RCC->PRST_EN = (SetValue);
}

uint32_t RCC_PRST_EN_Read(void)
{
	return (RCC->PRST_EN);
}

/* DMA模块复位 相关函数 */
void RCC_AHBRST_CR_DMARST_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
    RCC->AHBRST_CR |= (RCC_AHBRST_CR_DMARST_Msk);
	}
	else
	{
		RCC->AHBRST_CR &= ~(RCC_AHBRST_CR_DMARST_Msk);
	}
}

FunState RCC_AHBRST_CR_DMARST_Getable(void)
{
	if (RCC->AHBRST_CR & (RCC_AHBRST_CR_DMARST_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* UART5模块复位 相关函数 */
void RCC_APBRST_CR1_UART5RST_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
    RCC->APBRST_CR1 |= (RCC_APBRST_CR1_UART5RST_Msk);
	}
	else
	{
		RCC->APBRST_CR1 &= ~(RCC_APBRST_CR1_UART5RST_Msk);
	}
}

FunState RCC_APBRST_CR1_UART5RST_Getable(void)
{
	if (RCC->APBRST_CR1 & (RCC_APBRST_CR1_UART5RST_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* UART4模块复位 相关函数 */
void RCC_APBRST_CR1_UART4RST_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
    RCC->APBRST_CR1 |= (RCC_APBRST_CR1_UART4RST_Msk);
	}
	else
	{
		RCC->APBRST_CR1 &= ~(RCC_APBRST_CR1_UART4RST_Msk);
	}
}

FunState RCC_APBRST_CR1_UART4RST_Getable(void)
{
	if (RCC->APBRST_CR1 & (RCC_APBRST_CR1_UART4RST_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* GPTIM1模块复位 相关函数 */
void RCC_APBRST_CR1_GT1RST_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
    RCC->APBRST_CR1 |= (RCC_APBRST_CR1_GT1RST_Msk);
	}
	else
	{
		RCC->APBRST_CR1 &= ~(RCC_APBRST_CR1_GT1RST_Msk);
	}
}

FunState RCC_APBRST_CR1_GT1RST_Getable(void)
{
	if (RCC->APBRST_CR1 & (RCC_APBRST_CR1_GT1RST_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* GPTIM0模块复位 相关函数 */
void RCC_APBRST_CR1_GT0RST_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
    RCC->APBRST_CR1 |= (RCC_APBRST_CR1_GT0RST_Msk);
	}
	else
	{
		RCC->APBRST_CR1 &= ~(RCC_APBRST_CR1_GT0RST_Msk);
	}
}

FunState RCC_APBRST_CR1_GT0RST_Getable(void)
{
	if (RCC->APBRST_CR1 & (RCC_APBRST_CR1_GT0RST_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* LCD模块复位 相关函数 */
void RCC_APBRST_CR1_LCDRST_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
    RCC->APBRST_CR1 |= (RCC_APBRST_CR1_LCDRST_Msk);
	}
	else
	{
		RCC->APBRST_CR1 &= ~(RCC_APBRST_CR1_LCDRST_Msk);
	}
}

