wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_rcc.c
FunState RCC_APBRST_CR1_LCDRST_Getable(void)
{
	if (RCC->APBRST_CR1 & (RCC_APBRST_CR1_LCDRST_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* U7816模块复位 相关函数 */
void RCC_APBRST_CR1_U7816RST_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
    RCC->APBRST_CR1 |= (RCC_APBRST_CR1_U7816RST_Msk);
	}
	else
	{
		RCC->APBRST_CR1 &= ~(RCC_APBRST_CR1_U7816RST_Msk);
	}
}

FunState RCC_APBRST_CR1_U7816RST_Getable(void)
{
	if (RCC->APBRST_CR1 & (RCC_APBRST_CR1_U7816RST_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* SPI2模块复位 相关函数 */
void RCC_APBRST_CR1_SPI2RST_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
    RCC->APBRST_CR1 |= (RCC_APBRST_CR1_SPI2RST_Msk);
	}
	else
	{
		RCC->APBRST_CR1 &= ~(RCC_APBRST_CR1_SPI2RST_Msk);
	}
}

FunState RCC_APBRST_CR1_SPI2RST_Getable(void)
{
	if (RCC->APBRST_CR1 & (RCC_APBRST_CR1_SPI2RST_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* LPUART0模块复位 相关函数 */
void RCC_APBRST_CR1_LPUART0RST_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
    RCC->APBRST_CR1 |= (RCC_APBRST_CR1_LPUART0RST_Msk);
	}
	else
	{
		RCC->APBRST_CR1 &= ~(RCC_APBRST_CR1_LPUART0RST_Msk);
	}
}

FunState RCC_APBRST_CR1_LPUART0RST_Getable(void)
{
	if (RCC->APBRST_CR1 & (RCC_APBRST_CR1_LPUART0RST_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* I2C模块复位 相关函数 */
void RCC_APBRST_CR1_I2CRST_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
    RCC->APBRST_CR1 |= (RCC_APBRST_CR1_I2CRST_Msk);
	}
	else
	{
		RCC->APBRST_CR1 &= ~(RCC_APBRST_CR1_I2CRST_Msk);
	}
}

FunState RCC_APBRST_CR1_I2CRST_Getable(void)
{
	if (RCC->APBRST_CR1 & (RCC_APBRST_CR1_I2CRST_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* LPTIM32模块复位 相关函数 */
void RCC_APBRST_CR1_LPT32RST_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
    RCC->APBRST_CR1 |= (RCC_APBRST_CR1_LPT32RST_Msk);
	}
	else
	{
    RCC->APBRST_CR1 &= ~(RCC_APBRST_CR1_LPT32RST_Msk);
	}
}

FunState RCC_APBRST_CR1_LPT32RST_Getable(void)
{
	if (RCC->APBRST_CR1 & (RCC_APBRST_CR1_LPT32RST_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* ATIM模块复位 相关函数 */
void RCC_APBRST_CR2_ATRST_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
    RCC->APBRST_CR2 |= (RCC_APBRST_CR2_ATRST_Msk);
	}
	else
	{
		RCC->APBRST_CR2 &= ~(RCC_APBRST_CR2_ATRST_Msk);
	}
}

FunState RCC_APBRST_CR2_ATRST_Getable(void)
{
	if (RCC->APBRST_CR2 & (RCC_APBRST_CR2_ATRST_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* BSTIM模块复位 相关函数 */
void RCC_APBRST_CR2_BTRST_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
    RCC->APBRST_CR2 |= (RCC_APBRST_CR2_BTRST_Msk);
	}
	else
	{
		RCC->APBRST_CR2 &= ~(RCC_APBRST_CR2_BTRST_Msk);
	}
}

FunState RCC_APBRST_CR2_BTRST_Getable(void)
{
	if (RCC->APBRST_CR2 & (RCC_APBRST_CR2_BTRST_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* ADC控制器复位 相关函数 */
void RCC_APBRST_CR2_ADCCRST_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
    RCC->APBRST_CR2 |= (RCC_APBRST_CR2_ADCCRST_Msk);
	}
	else
	{
		RCC->APBRST_CR2 &= ~(RCC_APBRST_CR2_ADCCRST_Msk);
	}
}

FunState RCC_APBRST_CR2_ADCCRST_Getable(void)
{
	if (RCC->APBRST_CR2 & (RCC_APBRST_CR2_ADCCRST_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* ADC模块复位 相关函数 */
void RCC_APBRST_CR2_ADCRST_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
    RCC->APBRST_CR2 |= (RCC_APBRST_CR2_ADCRST_Msk);
	}
	else
	{
		RCC->APBRST_CR2 &= ~(RCC_APBRST_CR2_ADCRST_Msk);
	}
}

FunState RCC_APBRST_CR2_ADCRST_Getable(void)
{
	if (RCC->APBRST_CR2 & (RCC_APBRST_CR2_ADCRST_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 运放模块复位 相关函数 */
void RCC_APBRST_CR2_OPARST_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
    RCC->APBRST_CR2 |= (RCC_APBRST_CR2_OPARST_Msk);
	}
	else
	{
		RCC->APBRST_CR2 &= ~(RCC_APBRST_CR2_OPARST_Msk);
	}
}

FunState RCC_APBRST_CR2_OPARST_Getable(void)
{
	if (RCC->APBRST_CR2 & (RCC_APBRST_CR2_OPARST_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* AES模块复位 相关函数 */
void RCC_APBRST_CR2_AESRST_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
    RCC->APBRST_CR2 |= (RCC_APBRST_CR2_AESRST_Msk);
	}
	else
	{
		RCC->APBRST_CR2 &= ~(RCC_APBRST_CR2_AESRST_Msk);
	}
}

FunState RCC_APBRST_CR2_AESRST_Getable(void)
{
	if (RCC->APBRST_CR2 & (RCC_APBRST_CR2_AESRST_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* CRC模块复位 相关函数 */
void RCC_APBRST_CR2_CRCRST_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
    RCC->APBRST_CR2 |= (RCC_APBRST_CR2_CRCRST_Msk);
	}
	else
	{
		RCC->APBRST_CR2 &= ~(RCC_APBRST_CR2_CRCRST_Msk);
	}
}

FunState RCC_APBRST_CR2_CRCRST_Getable(void)
{
	if (RCC->APBRST_CR2 & (RCC_APBRST_CR2_CRCRST_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* RNG模块复位 相关函数 */
void RCC_APBRST_CR2_RNGRST_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
    RCC->APBRST_CR2 |= (RCC_APBRST_CR2_RNGRST_Msk);
	}
	else
	{
		RCC->APBRST_CR2 &= ~(RCC_APBRST_CR2_RNGRST_Msk);
	}
}

FunState RCC_APBRST_CR2_RNGRST_Getable(void)
{
	if (RCC->APBRST_CR2 & (RCC_APBRST_CR2_RNGRST_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* UART1模块复位 相关函数 */
void RCC_APBRST_CR2_UART1RST_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
    RCC->APBRST_CR2 |= (RCC_APBRST_CR2_UART1RST_Msk);
	}
	else
	{
		RCC->APBRST_CR2 &= ~(RCC_APBRST_CR2_UART1RST_Msk);
	}
}

FunState RCC_APBRST_CR2_UART1RST_Getable(void)
{
	if (RCC->APBRST_CR2 & (RCC_APBRST_CR2_UART1RST_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* UART0模块复位 相关函数 */
void RCC_APBRST_CR2_UART0RST_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
     RCC->APBRST_CR2 |= (RCC_APBRST_CR2_UART0RST_Msk);
	}
	else
	{
		 RCC->APBRST_CR2 &= ~(RCC_APBRST_CR2_UART0RST_Msk);
	}
}

