wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_rcc.c
FunState RCC_APBRST_CR2_UART0RST_Getable(void)
{
	if (RCC->APBRST_CR2 & (RCC_APBRST_CR2_UART0RST_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* SPI1模块复位 相关函数 */
void RCC_APBRST_CR2_SPI1RST_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
    RCC->APBRST_CR2 |= (RCC_APBRST_CR2_SPI1RST_Msk);
	}
	else
	{
		RCC->APBRST_CR2 &= ~(RCC_APBRST_CR2_SPI1RST_Msk);
	}
}

FunState RCC_APBRST_CR2_SPI1RST_Getable(void)
{
	if (RCC->APBRST_CR2 & (RCC_APBRST_CR2_SPI1RST_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* UART红外调制模块复位 相关函数 */
void RCC_APBRST_CR2_UCIRRST_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
    RCC->APBRST_CR2 |= (RCC_APBRST_CR2_UCIRRST_Msk);
	}
	else
	{
		RCC->APBRST_CR2 &= ~(RCC_APBRST_CR2_UCIRRST_Msk);
	}
}

FunState RCC_APBRST_CR2_UCIRRST_Getable(void)
{
	if (RCC->APBRST_CR2 & (RCC_APBRST_CR2_UCIRRST_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* LPUART1模块复位 相关函数 */
void RCC_APBRST_CR2_LPUART1RST_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
    RCC->APBRST_CR2 |= (RCC_APBRST_CR2_LPUART1RST_Msk);
	}
	else
	{
		RCC->APBRST_CR2 &= ~(RCC_APBRST_CR2_LPUART1RST_Msk);
	}
}

FunState RCC_APBRST_CR2_LPUART1RST_Getable(void)
{
	if (RCC->APBRST_CR2 & (RCC_APBRST_CR2_LPUART1RST_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}


/* XTHF振荡强度配置 相关函数 */
void RCC_XTHF_CR_CFG_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = RCC->XTHF_CR;
	tmpreg &= ~(RCC_XTHF_CR_CFG_Msk);
	tmpreg |= (SetValue & RCC_XTHF_CR_CFG_Msk);
	RCC->XTHF_CR = tmpreg;
}

uint32_t RCC_XTHF_CR_CFG_Get(void)
{
	return (RCC->XTHF_CR & RCC_XTHF_CR_CFG_Msk);
}

/* XTHF使能寄存器 相关函数 */
void RCC_XTHF_CR_EN_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		RCC->XTHF_CR |= (RCC_XTHF_CR_EN_Msk);
	}
	else
	{
		RCC->XTHF_CR &= ~(RCC_XTHF_CR_EN_Msk);
	}
}

FunState RCC_XTHF_CR_EN_Getable(void)
{
	if (RCC->XTHF_CR & (RCC_XTHF_CR_EN_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* RC4M输出预分频  相关函数 */
void RCC_RC4M_CR_PSC_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = RCC->RC4M_CR;
	tmpreg &= ~(RCC_RC4M_CR_PSC_Msk);
	tmpreg |= (SetValue & RCC_RC4M_CR_PSC_Msk);
	RCC->RC4M_CR = tmpreg;
}

uint32_t RCC_RC4M_CR_PSC_Get(void)
{
	return (RCC->RC4M_CR & RCC_RC4M_CR_PSC_Msk);
}

/* RC4M使能寄存器 相关函数 */
void RCC_RC4M_CR_EN_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		RCC->RC4M_CR |= (RCC_RC4M_CR_EN_Msk);
	}
	else
	{
		RCC->RC4M_CR &= ~(RCC_RC4M_CR_EN_Msk);
	}
}

FunState RCC_RC4M_CR_EN_Getable(void)
{
	if (RCC->RC4M_CR & (RCC_RC4M_CR_EN_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* RCHF频率调校寄存器 相关函数 */
void RCC_RCHF_TR_Write(uint32_t SetValue)
{
	RCC->RCHF_TR = (SetValue & RCC_RCHF_TR_TRIM_Msk);
}

uint32_t RCC_RCHF_TR_Read(void)
{
	return (RCC->RCHF_TR & RCC_RCHF_TR_TRIM_Msk);
}

void RCC_OPC_CR1_EXTICKE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		RCC->OPC_CR1 |= (RCC_OPC_CR1_EXTICKE_Msk);
	}
	else
	{
		RCC->OPC_CR1 &= ~(RCC_OPC_CR1_EXTICKE_Msk);
	}
}

FunState RCC_OPC_CR1_EXTICKE_Getable(void)
{
	if (RCC->OPC_CR1 & (RCC_OPC_CR1_EXTICKE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* EXTI中断采样时钟选择 相关函数 */
void RCC_OPC_CR1_EXTICKS_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = RCC->OPC_CR1;
	tmpreg &= ~(RCC_OPC_CR1_EXTICKS_Msk);
	tmpreg |= (SetValue & RCC_OPC_CR1_EXTICKS_Msk);
	RCC->OPC_CR1 = tmpreg;
}

uint32_t RCC_OPC_CR1_EXTICKS_Get(void)
{
	return (RCC->OPC_CR1 & RCC_OPC_CR1_EXTICKS_Msk);
}

void RCC_OPC_CR1_LPUART1CKE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		RCC->OPC_CR1 |= (RCC_OPC_CR1_LPUART1CKE_Msk);
	}
	else
	{
		RCC->OPC_CR1 &= ~(RCC_OPC_CR1_LPUART1CKE_Msk);
	}
}

FunState RCC_OPC_CR1_LPUART1CKE_Getable(void)
{
	if (RCC->OPC_CR1 & (RCC_OPC_CR1_LPUART1CKE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

void RCC_OPC_CR1_LPUART0CKE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		RCC->OPC_CR1 |= (RCC_OPC_CR1_LPUART0CKE_Msk);
	}
	else
	{
		RCC->OPC_CR1 &= ~(RCC_OPC_CR1_LPUART0CKE_Msk);
	}
}

FunState RCC_OPC_CR1_LPUART0CKE_Getable(void)
{
	if (RCC->OPC_CR1 & (RCC_OPC_CR1_LPUART0CKE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

void RCC_OPC_CR1_LPUART1CKS_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = RCC->OPC_CR1;
	tmpreg &= ~(RCC_OPC_CR1_LPUART1CKS_Msk);
	tmpreg |= (SetValue & RCC_OPC_CR1_LPUART1CKS_Msk);
	RCC->OPC_CR1 = tmpreg;
}

uint32_t RCC_OPC_CR1_LPUART1CKS_Get(void)
{
	return (RCC->OPC_CR1 & RCC_OPC_CR1_LPUART1CKS_Msk);
}

void RCC_OPC_CR1_LPUART0CKS_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = RCC->OPC_CR1;
	tmpreg &= ~(RCC_OPC_CR1_LPUART0CKS_Msk);
	tmpreg |= (SetValue & RCC_OPC_CR1_LPUART0CKS_Msk);
	RCC->OPC_CR1 = tmpreg;
}

uint32_t RCC_OPC_CR1_LPUART0CKS_Get(void)
{
	return (RCC->OPC_CR1 & RCC_OPC_CR1_LPUART0CKS_Msk);
}

void RCC_OPC_CR1_BEEPCKE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		RCC->OPC_CR1 |= (RCC_OPC_CR1_BEEPCKE_Msk);
	}
	else
	{
		RCC->OPC_CR1 &= ~(RCC_OPC_CR1_BEEPCKE_Msk);
	}
}

FunState RCC_OPC_CR1_BEEPCKE_Getable(void)
{
	if (RCC->OPC_CR1 & (RCC_OPC_CR1_BEEPCKE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

void RCC_OPC_CR1_I2CCKE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		RCC->OPC_CR1 |= (RCC_OPC_CR1_I2CCKE_Msk);
	}
	else
	{
		RCC->OPC_CR1 &= ~(RCC_OPC_CR1_I2CCKE_Msk);
	}
}

FunState RCC_OPC_CR1_I2CCKE_Getable(void)
{
	if (RCC->OPC_CR1 & (RCC_OPC_CR1_I2CCKE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

void RCC_OPC_CR1_BEEPCKS_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = RCC->OPC_CR1;
	tmpreg &= ~(RCC_OPC_CR1_BEEPCKS_Msk);
	tmpreg |= (SetValue & RCC_OPC_CR1_BEEPCKS_Msk);
	RCC->OPC_CR1 = tmpreg;
}

