wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_rcc.c
uint32_t RCC_OPC_CR1_BEEPCKS_Get(void)
{
	return (RCC->OPC_CR1 & RCC_OPC_CR1_BEEPCKS_Msk);
}

/* I2C主机工作时钟选择 相关函数 */
void RCC_OPC_CR1_I2CCKS_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = RCC->OPC_CR1;
	tmpreg &= ~(RCC_OPC_CR1_I2CCKS_Msk);
	tmpreg |= (SetValue & RCC_OPC_CR1_I2CCKS_Msk);
	RCC->OPC_CR1 = tmpreg;
}

uint32_t RCC_OPC_CR1_I2CCKS_Get(void)
{
	return (RCC->OPC_CR1 & RCC_OPC_CR1_I2CCKS_Msk);
}

void RCC_OPC_CR1_UART1CKE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		RCC->OPC_CR1 |= (RCC_OPC_CR1_UART1CKE_Msk);
	}
	else
	{
		RCC->OPC_CR1 &= ~(RCC_OPC_CR1_UART1CKE_Msk);
	}
}

FunState RCC_OPC_CR1_UART1CKE_Getable(void)
{
	if (RCC->OPC_CR1 & (RCC_OPC_CR1_UART1CKE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

void RCC_OPC_CR1_UART0CKE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		RCC->OPC_CR1 |= (RCC_OPC_CR1_UART0CKE_Msk);
	}
	else
	{
		RCC->OPC_CR1 &= ~(RCC_OPC_CR1_UART0CKE_Msk);
	}
}

FunState RCC_OPC_CR1_UART0CKE_Getable(void)
{
	if (RCC->OPC_CR1 & (RCC_OPC_CR1_UART0CKE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* UART1工作时钟选择 相关函数 */
void RCC_OPC_CR1_UART1CKS_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = RCC->OPC_CR1;
	tmpreg &= ~(RCC_OPC_CR1_UART1CKS_Msk);
	tmpreg |= (SetValue & RCC_OPC_CR1_UART1CKS_Msk);
	RCC->OPC_CR1 = tmpreg;
}

uint32_t RCC_OPC_CR1_UART1CKS_Get(void)
{
	return (RCC->OPC_CR1 & RCC_OPC_CR1_UART1CKS_Msk);
}

/* UART0工作时钟选择 相关函数 */
void RCC_OPC_CR1_UART0CKS_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = RCC->OPC_CR1;
	tmpreg &= ~(RCC_OPC_CR1_UART0CKS_Msk);
	tmpreg |= (SetValue & RCC_OPC_CR1_UART0CKS_Msk);
	RCC->OPC_CR1 = tmpreg;
}

uint32_t RCC_OPC_CR1_UART0CKS_Get(void)
{
	return (RCC->OPC_CR1 & RCC_OPC_CR1_UART0CKS_Msk);
}

/* 随机数发生器工作时钟分频 相关函数 */
void RCC_OPC_CR2_RNGPRSC_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = RCC->OPC_CR2;
	tmpreg &= ~(RCC_OPC_CR2_RNGPRSC_Msk);
	tmpreg |= (SetValue & RCC_OPC_CR2_RNGPRSC_Msk);
	RCC->OPC_CR2 = tmpreg;
}

uint32_t RCC_OPC_CR2_RNGPRSC_Get(void)
{
	return (RCC->OPC_CR2 & RCC_OPC_CR2_RNGPRSC_Msk);
}

/* ADC工作时钟预分频 相关函数 */
void RCC_OPC_CR2_ADCPRSC_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = RCC->OPC_CR2;
	tmpreg &= ~(RCC_OPC_CR2_ADCPRSC_Msk);
	tmpreg |= (SetValue & RCC_OPC_CR2_ADCPRSC_Msk);
	RCC->OPC_CR2 = tmpreg;
}

uint32_t RCC_OPC_CR2_ADCPRSC_Get(void)
{
	return (RCC->OPC_CR2 & RCC_OPC_CR2_ADCPRSC_Msk);
}

void RCC_OPC_CR2_FLSCKE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		RCC->OPC_CR2 |= (RCC_OPC_CR2_FLSCKE_Msk);
	}
	else
	{
		RCC->OPC_CR2 &= ~(RCC_OPC_CR2_FLSCKE_Msk);
	}
}

FunState RCC_OPC_CR2_FLSCKE_Getable(void)
{
	if (RCC->OPC_CR2 & (RCC_OPC_CR2_FLSCKE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

void RCC_OPC_CR2_RNGCKE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		RCC->OPC_CR2 |= (RCC_OPC_CR2_RNGCKE_Msk);
	}
	else
	{
		RCC->OPC_CR2 &= ~(RCC_OPC_CR2_RNGCKE_Msk);
	}
}

FunState RCC_OPC_CR2_RNGCKE_Getable(void)
{
	if (RCC->OPC_CR2 & (RCC_OPC_CR2_RNGCKE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

void RCC_OPC_CR2_ADCCKE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		RCC->OPC_CR2 |= (RCC_OPC_CR2_ADCCKE_Msk);
	}
	else
	{
		RCC->OPC_CR2 &= ~(RCC_OPC_CR2_ADCCKE_Msk);
	}
}

FunState RCC_OPC_CR2_ADCCKE_Getable(void)
{
	if (RCC->OPC_CR2 & (RCC_OPC_CR2_ADCCKE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* ADC工作时钟选择 相关函数 */
void RCC_OPC_CR2_ADCCKS_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = RCC->OPC_CR2;
	tmpreg &= ~(RCC_OPC_CR2_ADCCKS_Msk);
	tmpreg |= (SetValue & RCC_OPC_CR2_ADCCKS_Msk);
	RCC->OPC_CR2 = tmpreg;
}

uint32_t RCC_OPC_CR2_ADCCKS_Get(void)
{
	return (RCC->OPC_CR2 & RCC_OPC_CR2_ADCCKS_Msk);
}

void RCC_OPC_CR2_LPTCKE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		RCC->OPC_CR2 |= (RCC_OPC_CR2_LPTCKE_Msk);
	}
	else
	{
		RCC->OPC_CR2 &= ~(RCC_OPC_CR2_LPTCKE_Msk);
	}
}

FunState RCC_OPC_CR2_LPTCKE_Getable(void)
{
	if (RCC->OPC_CR2 & (RCC_OPC_CR2_LPTCKE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* LPTIM工作时钟选择 相关函数 */
void RCC_OPC_CR2_LPTCKS_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = RCC->OPC_CR2;
	tmpreg &= ~(RCC_OPC_CR2_LPTCKS_Msk);
	tmpreg |= (SetValue & RCC_OPC_CR2_LPTCKS_Msk);
	RCC->OPC_CR2 = tmpreg;
}

uint32_t RCC_OPC_CR2_LPTCKS_Get(void)
{
	return (RCC->OPC_CR2 & RCC_OPC_CR2_LPTCKS_Msk);
}

void RCC_OPC_CR2_BTCKE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		RCC->OPC_CR2 |= (RCC_OPC_CR2_BTCKE_Msk);
	}
	else
	{
		RCC->OPC_CR2 &= ~(RCC_OPC_CR2_BTCKE_Msk);
	}
}

FunState RCC_OPC_CR2_BTCKE_Getable(void)
{
	if (RCC->OPC_CR2 & (RCC_OPC_CR2_BTCKE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* BSTIM工作时钟源选择 相关函数 */
void RCC_OPC_CR2_BTCKS_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = RCC->OPC_CR2;
	tmpreg &= ~(RCC_OPC_CR2_BTCKS_Msk);
	tmpreg |= (SetValue & RCC_OPC_CR2_BTCKS_Msk);
	RCC->OPC_CR2 = tmpreg;
}

uint32_t RCC_OPC_CR2_BTCKS_Get(void)
{
	return (RCC->OPC_CR2 & RCC_OPC_CR2_BTCKS_Msk);
}

/* 外设时钟配置函数 */
void RCC_PERCLK_SetableEx(uint32_t periph_def, FunState NewState)
{
	__IO uint32_t *p_reg = 0;
	uint32_t TempREG;
	
    switch((periph_def & 0x0F000000))
    {
		case 0x01000000:
			p_reg = &(RCC->PCLK_CR1);
			break;
		
		case 0x02000000:
			p_reg = &(RCC->PCLK_CR2);
			break;
		
		case 0x03000000:
			p_reg = &(RCC->PCLK_CR3);
			break;
		
		case 0x04000000:
			p_reg = &(RCC->PCLK_CR4);
			break;
		
		default:
			break;
    }
	if(p_reg)
	{
		periph_def &= 0x000000FF;
		TempREG = (0x1U << periph_def);
		
		if (NewState != DISABLE)
		{
			*p_reg |= TempREG;
		}
		else
		{
			*p_reg &= ~TempREG;
		}
	}
}

/* RCHF初始化 */
void RCC_RCHF_Init( RCC_RCHF_InitTypeDef* para)
{
   RCC_RCHF_CR_FSEL_Set(para->FSEL);
   RCC_RCHF_CR_EN_Setable(para->RCHFEN);
}

/********************************
设置PLL倍频函数
功能:对PLL倍频进行设置
输入：PLL倍频数
 ********************************/
void RCC_PLLDB_WriteEx(uint32_t SetValue)
{	
  RCC_PLL_CR_DB_Set(SetValue);
}
/********************************
读取PLL倍频函数
功能:读取对PLL倍频数
输出：PLL倍频数
 ********************************/
uint32_t RCC_PLLDB_ReadEx(void)
{
	uint32_t tmpreg;
	
	tmpreg =  RCC_PLL_CR_DB_Get();
	return (tmpreg>>RCC_PLL_CR_DB_Pos);
}

