wyp19960729/FM33L0XX-keil-GCC-/keil project/Drivers/fm33l0xx_rcc.c
/* PLL初始化 */
void RCC_PLL_Init(RCC_PLL_InitTypeDef* para)
{
	RCC_PLLDB_WriteEx(para->PLLDB);
	RCC_PLL_CR_REFPRSC_Set(para->REFPRSC);
	RCC_PLL_CR_OSEL_Set(para->PLLOSEL);
	RCC_PLL_CR_INSEL_Set(para->PLLINSEL);
	RCC_PLL_CR_EN_Setable(para->PLLEN);
}

/* 系统时钟初始化 */
void RCC_SysClk_Init(RCC_SYSCLK_InitTypeDef* para)
{
	RCC_SYSCLK_CR_SYSCLKSEL_Set(para->SYSCLKSEL);
	RCC_SYSCLK_CR_STCLKSEL_Set(para->STCLKSEL);
	RCC_SYSCLK_CR_AHBPRES_Set(para->AHBPRES);
	RCC_SYSCLK_CR_APBPRES_Set(para->APBPRES);
	RCC_SYSCLK_CR_SLP_ENEXTI_Setable(para->SLP_ENEXTI);
	RCC_SYSCLK_CR_LSCATS_Setable(para->LSCATS);
}

/* RC4M初始化 */
void RCC_RC4M_Init(RCC_RC4M_InitTypeDef* para)
{
	RCC_RC4M_CR_PSC_Set(para->RC4MPSC);
	RCC_RC4M_CR_EN_Setable(para->RC4MEN);
}

void RCC_Init_RCHF_Trim( uint8_t ClkMode )
{
	uint32_t Temp32;
	
	if( ClkMode == 1 )	//8M
	{
		Temp32 = const_rchf_Trim8;
	}
	else if( ClkMode == 2 )//16M
	{
		Temp32 = const_rchf_Trim16;
	}
	else if( ClkMode == 3 )//24M
	{
		Temp32 = const_rchf_Trim24;
	}
	else//默认8M
	{
		Temp32 = const_rchf_Trim8;
	}
	
	if( ((Temp32>>16)&0x0000FFFF) == ((~Temp32)&0x0000FFFF) )	//正反码校验判断
	{
		RCC_RCHF_TR_Write(Temp32&0x0000007F);
	}	
	else
	{
		RCC_RCHF_TR_Write(0x00000040);
	}
}
void RCC_GetClocksFreq(RCC_ClocksType* para)
{
	uint32_t tmp32 = 0,tmp_value = 0;

	para->SYSCLK_Frequency = 0;
	para->AHBCLK_Frequency = 0;
	para->APBCLK_Frequency = 0;
	para->RCHF_Frequency = 0;
	para->PLL_Frequency = 0;
	para->RC4M_Frequency = 0;
	
	/* Get RCHF FSEL */
	if(ENABLE == RCC_RCHF_CR_EN_Getable())
	{
		tmp32 = RCC_RCHF_CR_FSEL_Get();
		tmp32 = tmp32 >> RCC_RCHF_CR_FSEL_Pos;  
		/* RCHF clock frequency */
		para->RCHF_Frequency = __RCHF_INITIAL_CLOCK * (tmp32 + 1);
	}

	if(ENABLE == RCC_PLL_CR_EN_Getable())
	{
		/* Get Pll frequency */
		tmp32 = RCC_PLL_CR_INSEL_Get();
		tmp32 = tmp32 >> RCC_PLL_CR_INSEL_Pos;
    
    tmp_value = 1000000;
    		
		tmp32 = RCC_PLL_CR_DB_Get();
		para->PLL_Frequency = (tmp32 + 1) * tmp_value;
	}
	
	/* Get SYSCLK source */
    tmp32 = RCC_SYSCLK_CR_SYSCLKSEL_Get();
    tmp32 = tmp32 >> RCC_SYSCLK_CR_SYSCLKSEL_Pos;
    switch (tmp32)
    {
        case 0x00:  /* RCHF used as system clock source */
            para->SYSCLK_Frequency = para->RCHF_Frequency;
            break;
        case 0x01:  /* XTHF used as system clock  source */
            para->SYSCLK_Frequency = __XTHF_CLOCK;
            break;
        case 0x02:  /* PLL used as system clock  source */
            para->SYSCLK_Frequency = para->PLL_Frequency;
            break;
        case 0x03:  /* RCHF used as system clock  source */
            para->SYSCLK_Frequency = para->RCHF_Frequency;
            break;
				case 0x04:  /* RC4MPSC used as system clock  source */
            para->SYSCLK_Frequency = para->RC4M_Frequency;
            break;
        case 0x05:
            para->SYSCLK_Frequency =__XTLF_CLOCK;
            break;
        case 0x06:
            para->SYSCLK_Frequency =__XTLF_CLOCK;
            break;
        case 0x07:
            para->SYSCLK_Frequency =__XTLF_CLOCK;
            break;
        default:
            para->SYSCLK_Frequency = para->RCHF_Frequency;
            break;
    }
	
	/* Get AHB PRES */
    tmp32 = RCC_SYSCLK_CR_AHBPRES_Get();
    tmp32 = tmp32 >> RCC_SYSCLK_CR_AHBPRES_Pos;  
    switch(tmp32)
    {
        case 0x04: //100:DIV2
            para->AHBCLK_Frequency = para->SYSCLK_Frequency/2;
            break;
        case 0x05: //101:DIV4
            para->AHBCLK_Frequency = para->SYSCLK_Frequency/4;
            break;
        case 0x06: //110:DIV8
            para->AHBCLK_Frequency = para->SYSCLK_Frequency/8;
            break;
        case 0x07: //111:DIV16
            para->AHBCLK_Frequency = para->SYSCLK_Frequency/16;
            break;
        default: //0XX:DIV1
            para->AHBCLK_Frequency = para->SYSCLK_Frequency;
            break;
    }

	/* Get APB PRES */
    tmp32 = RCC_SYSCLK_CR_APBPRES_Get();
    tmp32 = tmp32 >> RCC_SYSCLK_CR_APBPRES_Pos; 
	/* APB clock frequency */
    switch(tmp32)
    {
        case 0x04: //100:DIV2
            para->APBCLK_Frequency = para->AHBCLK_Frequency/2;
            break;
        case 0x05: //101:DIV4
            para->APBCLK_Frequency = para->AHBCLK_Frequency/4;
            break;
        case 0x06: //110:DIV8
            para->APBCLK_Frequency = para->AHBCLK_Frequency/8;
            break;
        case 0x07: //111:DIV16
            para->APBCLK_Frequency = para->AHBCLK_Frequency/16;
            break;
        default: //0XX:DIV1
            para->APBCLK_Frequency = para->AHBCLK_Frequency;
            break;
    }
}

void RCC_FDET_IER_HFDET_IE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		RCC_FDET->IER |= (RCC_FDET_IER_HFDET_IE_Msk);
	}
	else
	{
		RCC_FDET->IER &= ~(RCC_FDET_IER_HFDET_IE_Msk);
	}
}

FunState RCC_FDET_IER_HFDET_IE_Getable(void)
{
	if (RCC_FDET->IER & (RCC_FDET_IER_HFDET_IE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

void RCC_FDET_IER_LFDET_IE_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		RCC_FDET->IER |= (RCC_FDET_IER_LFDET_IE_Msk);
	}
	else
	{
		RCC_FDET->IER &= ~(RCC_FDET_IER_LFDET_IE_Msk);
	}
}

FunState RCC_FDET_IER_LFDET_IE_Getable(void)
{
	if (RCC_FDET->IER & (RCC_FDET_IER_LFDET_IE_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 高频晶体停振检测模块输出 相关函数 */
FlagStatus RCC_FDET_ISR_HFDETO_Chk(void)
{
	if (RCC_FDET->ISR & RCC_FDET_ISR_HFDETO_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/* 低频晶体停振检测模块输出 相关函数 */
FlagStatus RCC_FDET_ISR_LFDETO_Chk(void)
{
	if (RCC_FDET->ISR & RCC_FDET_ISR_LFDETO_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/* 高频停振检测中断标志寄存器 相关函数 */
void RCC_FDET_ISR_HFDETIF_Clr(void)
{
	RCC_FDET->ISR = RCC_FDET_ISR_HFDETIF_Msk;
}

FlagStatus RCC_FDET_ISR_HFDETIF_Chk(void)
{
	if (RCC_FDET->ISR & RCC_FDET_ISR_HFDETIF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/* 低频停振检测中断标志寄存器 相关函数 */
void RCC_FDET_ISR_LFDETIF_Clr(void)
{
	RCC_FDET->ISR = RCC_FDET_ISR_LFDETIF_Msk;
}

FlagStatus RCC_FDET_ISR_LFDETIF_Chk(void)
{
	if (RCC_FDET->ISR & RCC_FDET_ISR_LFDETIF_Msk)
	{
		return SET;
	}
	else
	{
		return RESET;
	}
}

/* 下电复位电压配置 相关函数 */
void RCC_PDR_CR_CFG_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = RCC_PDR->CR;
	tmpreg &= ~(RCC_PDR_CR_CFG_Msk);
	tmpreg |= (SetValue & RCC_PDR_CR_CFG_Msk);
	RCC_PDR->CR = tmpreg;
}

uint32_t RCC_PDR_CR_CFG_Get(void)
{
	return (RCC_PDR->CR & RCC_PDR_CR_CFG_Msk);
}

/* 下电复位使能 相关函数 */
void RCC_PDR_CR_EN_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
		RCC_PDR->CR |= (RCC_PDR_CR_EN_Msk);
	}
	else
	{
		RCC_PDR->CR &= ~(RCC_PDR_CR_EN_Msk);
	}
}

FunState RCC_PDR_CR_EN_Getable(void)
{
	if (RCC_PDR->CR & (RCC_PDR_CR_EN_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/* 下电复位电压配置 相关函数 */
void RCC_BOR_CR_CFG_Set(uint32_t SetValue)
{
	uint32_t tmpreg;
	tmpreg = RCC_BOR->CR;
	tmpreg &= ~(RCC_BOR_CR_CFG_Msk);
	tmpreg |= (SetValue & RCC_BOR_CR_CFG_Msk);
	RCC_BOR->CR = tmpreg;
}

uint32_t RCC_BOR_CR_CFG_Get(void)
{
	return (RCC_BOR->CR & RCC_BOR_CR_CFG_Msk);
}

/* 下电复位使能 相关函数 */
void RCC_BOR_CR_OFF_BOR_Setable(FunState NewState)
{
	if (NewState == ENABLE)
	{
    RCC_BOR->CR |= (RCC_BOR_CR_OFF_BOR_Msk);
	}
	else
	{
		RCC_BOR->CR &= ~(RCC_BOR_CR_OFF_BOR_Msk);
	}
}

FunState RCC_BOR_CR_OFF_BOR_Getable(void)
{
	if (RCC_BOR->CR & (RCC_BOR_CR_OFF_BOR_Msk))
	{
		return ENABLE;
	}
	else
	{
		return DISABLE;
	}
}

/******END OF FILE****/
